#include "util.h"
/****************************************************************************
* 名    称：void delay_ns(void)
* 功    能：延迟ns
* 入口参数：uint16_t delay 延迟的ns数
* 出口参数：无
* 说    明：
* 调用方法：无 
****************************************************************************/
void delay_ns(uint16_t delay)
{
	for(;delay>=1;delay--)
	{
		__nop(); //nop相当于十几个ns
	}
}
/****************************************************************************
* 名    称：void delay_ms(void)
* 功    能：延迟ms
* 入口参数：__IO uint32_t time 延迟的ms数
* 出口参数：无
* 说    明：
* 调用方法：无 
****************************************************************************/

void delay_ms(__IO uint32_t time)
{
	timing_delay=time;
	while(timing_delay!=0);
}